# *Итоговый проект*

---
Для выполнения итогоговой проверочной работы необходимо решить следующую задачу:

написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
## *Описание решения*
---
 
Были созданы 2 метода:
1. void PrintArray(string[] array) - метод вывода всех элементов массива в консоль;
2. string[] GetNewArray(string[] array) - метод получения нового строкового массива из первоначально заданного при соответствии определённым условиям.

### *Метод вывода всех элементов массива в консоль*
---

Метод является типом void, поскольку ничего не возвращает.
В качестве аргумента метод принимает строковый массив. В теле метода все элементы массива выводятся в консоль при помощи встроенных методов Console.Write, Console.WriteLine и цикла for. Условием выхода из цикла является длина массива, к которой мы обращаемся через свойство Array.Length. 

### *Метод получения нового строкового массива из первоначально заданного при соответствии определённым условиям*
---

Блок-схема алгоритма метода имеется в данном репозитории.

Метод в качестве аргумента принимает строковый массив, возвращает массив строк, состоящих из трёх или менее символов.

 В начале метода объявляем две переменные типа int: 
 * length для обращения к длине массива(инициализируем через свойство Array.Length);
 *  count для подсчёта количества строк(элементов) нового массива(инициализируем 0). 
   
 А также создаём новый массив newArray размера length для записи в него строк, состоящих из трёх и менее символов.

 В цикле for обращаемся к элементам массива, а именно к длине каждой строки, т.к. строка - массив символов. И оператором ветвления if проверяем на соответствие условию(длина строки меньше или равна 3). Подходящие строки записываются в новый массив. В цикле также считается количество этих строк.

 Изменяем размер полученного массива, используя встроенный метод Array.Resize. 
### *Последние шаги*
---

 Первоначальный массив было решено задать. Сначала вызываем метод PrintArray для вывода в консоль первоначального массива. Затем создаём новый массив и инициализируем его методом GetNewArray. Также выводим его в консоль при помощи метода PrintArray.  